# black . - форматирование кода, black ./src форматирования конкретной директории
# не забывать проверять ввод пользователя
# не отправлять в .rar
# git remote -v --- посмотреть куда подключается git
# git remote remove --- удалить текущее подключение
# git add . или название папки (. текущая дериктория)
# git commit -m "text" --- это сохранение файлов локально
# git push origin main --- запушить код в git репозиторий
# git status посмотреть --- статус файлов индексирования
# git log посмотреть логи (--oneline --- в одну строку)
# git restore .\main.py скидывает на последнее сохраненное измененеие
# git giu --- показывают изменения в индексации git gif
# git commit --amend --no-edit --- добавить изменение в прошлый коммит --noedit не изменять сообщение
# git clone link получить код первый раз при работе с кодом
# git pull забрали изменение с гита без git clone
# git branch посмотреть ветки
# git fetch --all посмотреть на удаленном без pull
# git switch -c name_of_the_branch --- переключает ветку, + создает 1.
# git push --set-upstream origin lesson_23_2 пушим вторую ветку 2.
# после скидываем ссылку в текстовом файле
# git stash --- спрятать изменения


# assert для проверки кода
# unittest библиотека для проверки кода
